app/views/employee_reports/show.html.erb

<div class="row">
  <% @employee_report.employee_tasks.each do |task| %>
---
SELECT "employee_tasks".* FROM "employee_tasks" WHERE "employee_tasks"."employee_report_id" = ?  [["employee_report_id", 1]]