app/controllers/employee_tasks_controller.rb

SELECT `employee_tasks`.* FROM `employee_tasks` WHERE `employee_tasks`.`user_id` = 1
---
  def index
    @employee_tasks = current_user.employee_tasks.all

SELECT  "employee_reports".* FROM "employee_reports" WHERE "employee_reports"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def new
    @employee_task = current_user.employee_tasks.build
    @employee_report = EmployeeReport.find(params[:employee_report])

INSERT INTO `employee_tasks` (`Task_Name`, `Task_Start_Date`, `employee_report_id`, `created_at`, `updated_at`, `user_id`, `Task_Description`, `Task_Status`, `Task_Due_Date`) VALUES ('task 2', '2017-07-18', 3, '2017-07-18 10:17:49', '2017-07-18 10:17:49', 2, 'blah blah blah', 0, '2017-07-18')
---
  def create
    @employee_task = current_user.employee_tasks.build(employee_task_params)

    respond_to do |format|
      if @employee_task.save

UPDATE `employee_tasks` SET `Task_Status` = 1, `updated_at` = '2017-07-18 10:20:27' WHERE `employee_tasks`.`id` = 4
---
  def update
    respond_to do |format|
      if @employee_task.update(employee_task_params)

SELECT  "employee_tasks".* FROM "employee_tasks" WHERE "employee_tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_employee_task
      @employee_task = EmployeeTask.find(params[:id])