app/controllers/employee_reports_controller.rb

  def index
    @employee_reports = current_user.employee_reports.all.order("created_at DESC")
---
SELECT "employee_reports".* FROM "employee_reports" WHERE "employee_reports"."user_id" = ? ORDER BY created_at DESC  [["user_id", 1]]

  def create
    @employee_report = current_user.employee_reports.build(employee_report_params)

    respond_to do |format|
      if @employee_report.save
---
INSERT INTO `employee_reports` (`Report_Name`, `Report_Start_Date`, `Report_End_Date`, `employee_report_type_id`, `created_at`, `updated_at`, `user_id`) VALUES ('First Report', '2017-07-18', '2017-07-18', 1, '2017-07-18 08:35:11', '2017-07-18 08:35:11', 1)

  def update
    respond_to do |format|
      if @employee_report.update(employee_report_params)
---
UPDATE "employee_reports" SET "Report_Start_Date" = ?, "Report_End_Date" = ?, "updated_at" = ? WHERE "employee_reports"."id" = ?  [["Report_Start_Date", "2017-07-06"], ["Report_End_Date", "2017-07-18"], ["updated_at", "2017-07-14 12:20:54.839839"], ["id", 1]]

    def set_employee_report
      @employee_report = EmployeeReport.find(params[:id])
---
SELECT  "employee_reports".* FROM "employee_reports" WHERE "employee_reports"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]