app/controllers/employee_report_types_controller.rb

SELECT `employee_report_types`.* FROM `employee_report_types`
---
  def index
    @employee_report_types = EmployeeReportType.all

INSERT INTO "employee_report_types" ("Report_Type", "created_at", "updated_at") VALUES (?, ?, ?)  [["Report_Type", "Weekly Report"], ["created_at", "2017-07-14 07:38:16.907210"], ["updated_at", "2017-07-14 07:38:16.907210"]]
---
  def create
    @employee_report_type = EmployeeReportType.new(employee_report_type_params)

    respond_to do |format|
      if @employee_report_type.save

SELECT  "employee_report_types".* FROM "employee_report_types" WHERE "employee_report_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_employee_report_type
      @employee_report_type = EmployeeReportType.find(params[:id])