app/controllers/pages_controller.rb

SELECT `users`.* FROM `users`
SELECT `employee_reports`.* FROM `employee_reports`
---
  def manager
  	@user = User.all
  	@employee_reports = EmployeeReport.all